<script>
	import Button from '$lib/components/Button/Button.svelte'
</script>

<section class="container">
	<div class="mobile_info">
		<div class="rating">
			<div>4.8</div>
			<a href="">
				<span>Все отзывы</span>
				<svg width="5" height="9" viewBox="0 0 5 9" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M0.5 8.5L4.5 4.5L0.5 0.5" stroke="#272327" stroke-linecap="round" stroke-linejoin="round"/>
				</svg>
			</a>
		</div>
		<div class="to_favorite">
			<Button round>
				<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M12.3301 2.8252C14.354 2.82524 15.9999 4.47396 16 6.51758C16 7.3557 15.8668 8.12934 15.6348 8.84668H15.6338L15.6328 8.84961C15.0761 10.6112 13.9343 12.0357 12.6953 13.1006C11.454 14.1674 10.1439 14.8489 9.30371 15.1348L9.29883 15.1357C9.24149 15.156 9.133 15.1748 9 15.1748C8.867 15.1748 8.75851 15.156 8.70117 15.1357L8.69629 15.1348L8.36035 15.0088C7.52981 14.6723 6.39096 14.0342 5.30469 13.1006C4.06566 12.0357 2.9239 10.6112 2.36719 8.84961L2.36523 8.84668L2.2832 8.57422C2.10223 7.93434 2 7.25076 2 6.51758C2.00006 4.47396 3.64597 2.82524 5.66992 2.8252C6.86241 2.8252 7.93203 3.40472 8.59961 4.29688L9 4.83203L9.40039 4.29688C10.068 3.40472 11.1376 2.8252 12.3301 2.8252Z" stroke="#272327"/>
				</svg>
			</Button>

			<a href="">
				<span>В избранное</span>
				<svg width="5" height="9" viewBox="0 0 5 9" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M0.5 8.5L4.5 4.5L0.5 0.5" stroke="#272327" stroke-linecap="round" stroke-linejoin="round"/>
				</svg>
			</a>
		</div>
	</div>

	<div class="items">
		<div class="item">
			<div class="icon">
				<svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M18.75 12.5L17.5175 12.295C17.4877 12.474 17.4973 12.6573 17.5455 12.8322C17.5938 13.0072 17.6795 13.1695 17.7968 13.3079C17.9141 13.4464 18.0601 13.5577 18.2247 13.634C18.3893 13.7103 18.5686 13.7499 18.75 13.75V12.5ZM5 12.5V11.25C4.66848 11.25 4.35054 11.3817 4.11612 11.6161C3.8817 11.8505 3.75 12.1685 3.75 12.5H5ZM7.5 26.25H21.7V23.75H7.5V26.25ZM23.2 11.25H18.75V13.75H23.2V11.25ZM19.9838 12.705L20.99 6.66125L18.525 6.25L17.5175 12.295L19.9838 12.705ZM18.525 3.75H18.2575V6.25H18.525V3.75ZM14.0963 5.97625L10.9538 10.6938L13.0338 12.0813L16.1788 7.36375L14.0963 5.97625ZM9.9125 11.25H5V13.75H9.9125V11.25ZM3.75 12.5V22.5H6.25V12.5H3.75ZM25.3775 23.235L26.8775 15.735L24.4275 15.245L22.9275 22.745L25.3775 23.235ZM10.9538 10.6938C10.8396 10.8649 10.6837 11.0052 10.5022 11.1022C10.3208 11.1993 10.1182 11.25 9.9125 11.25V13.75C10.5298 13.75 11.1376 13.5975 11.6819 13.3062C12.2262 13.0149 12.6901 12.5937 13.0325 12.08L10.9538 10.6938ZM20.99 6.66125C21.0497 6.30317 21.0307 5.93639 20.9344 5.58639C20.838 5.23639 20.6666 4.91157 20.432 4.63452C20.1974 4.35747 19.9053 4.13483 19.576 3.98208C19.2467 3.82933 18.888 3.75014 18.525 3.75V6.25L20.99 6.66125ZM23.2 13.75C23.385 13.7499 23.5677 13.7909 23.7349 13.87C23.9021 13.9491 24.0497 14.0643 24.167 14.2073C24.2843 14.3503 24.3684 14.5175 24.4132 14.697C24.4581 14.8765 24.4638 15.0636 24.4275 15.245L26.8775 15.735C26.9862 15.1911 26.9729 14.6298 26.8386 14.0916C26.7042 13.5534 26.4521 13.0518 26.1005 12.6228C25.7488 12.1938 25.3064 11.8481 24.805 11.6107C24.3037 11.3734 23.756 11.2502 23.2013 11.25L23.2 13.75ZM21.7 26.25C22.567 26.2501 23.4073 25.9497 24.0778 25.4C24.7483 24.8503 25.2076 24.0852 25.3775 23.235L22.9275 22.745C22.8708 23.0287 22.7175 23.2839 22.4936 23.4672C22.2698 23.6505 21.9893 23.7504 21.7 23.75V26.25ZM18.2575 3.75C17.4344 3.75001 16.6241 3.95322 15.8984 4.34158C15.1727 4.72994 14.5529 5.29144 14.0963 5.97625L16.1788 7.36375C16.407 7.02123 16.715 6.74036 17.0778 6.54606C17.4407 6.35177 17.8459 6.25008 18.2575 6.25V3.75ZM7.5 23.75C7.16848 23.75 6.85054 23.6183 6.61612 23.3839C6.3817 23.1495 6.25 22.8315 6.25 22.5H3.75C3.75 23.4946 4.14509 24.4484 4.84835 25.1517C5.55161 25.8549 6.50544 26.25 7.5 26.25V23.75Z" fill="#F43F5E"/>
					<path d="M10 12.5V25" stroke="#F43F5E" stroke-width="1.75"/>
				</svg>
			</div>
			<div class="content">
				<div>Рекомендация</div>
				<div>Юниспорт рекомендует</div>
			</div>
		</div>
		<div class="item">
			<div class="icon">
				<svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M3.75 15C3.75 16.4774 4.04099 17.9403 4.60636 19.3052C5.17172 20.6701 6.00039 21.9103 7.04505 22.955C8.08971 23.9996 9.3299 24.8283 10.6948 25.3936C12.0597 25.959 13.5226 26.25 15 26.25C16.4774 26.25 17.9403 25.959 19.3052 25.3936C20.6701 24.8283 21.9103 23.9996 22.955 22.955C23.9996 21.9103 24.8283 20.6701 25.3936 19.3052C25.959 17.9403 26.25 16.4774 26.25 15C26.25 12.0163 25.0647 9.15483 22.955 7.04505C20.8452 4.93526 17.9837 3.75 15 3.75C12.0163 3.75 9.15483 4.93526 7.04505 7.04505C4.93526 9.15483 3.75 12.0163 3.75 15Z" stroke="#F43F5E" stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round"/>
					<path d="M15 8.75V15L18.75 18.75" stroke="#F43F5E" stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round"/>
				</svg>
			</div>
			<div class="content">
				<div>Место проведения</div>
				<div>8:00 - 23:00</div>
			</div>
		</div>
		<div class="item">
			<div class="icon">
				<svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M23.75 23.75H6.25V10H23.75M20 1.25V3.75H10V1.25H7.5V3.75H6.25C4.8625 3.75 3.75 4.8625 3.75 6.25V23.75C3.75 24.413 4.01339 25.0489 4.48223 25.5178C4.95107 25.9866 5.58696 26.25 6.25 26.25H23.75C24.413 26.25 25.0489 25.9866 25.5178 25.5178C25.9866 25.0489 26.25 24.413 26.25 23.75V6.25C26.25 5.58696 25.9866 4.95107 25.5178 4.48223C25.0489 4.01339 24.413 3.75 23.75 3.75H22.5V1.25M21.25 15H15V21.25H21.25V15Z" fill="#F43F5E"/>
				</svg>
			</div>
			<div class="content">
				<div>Дата проведения</div>
				<time datetime="20.01.2026">20.01.2026</time>
			</div>
		</div>
		<div class="item">
			<div class="icon">
				<svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path fill-rule="evenodd" clip-rule="evenodd" d="M15.11 26.8856L15.1125 26.8844L15.1187 26.88L15.1375 26.8656L15.2113 26.8125C15.2746 26.7663 15.3642 26.6987 15.48 26.61C15.71 26.4338 16.0363 26.1744 16.4256 25.8412C17.4478 24.9676 18.4035 24.0191 19.285 23.0037C21.3525 20.6125 23.5 17.2 23.5 13.2975C23.5 10.9662 22.5788 8.72875 20.9388 7.07875C20.1282 6.26206 19.1641 5.61377 18.102 5.1712C17.0398 4.72863 15.9006 4.50052 14.75 4.5C13.5994 4.50044 12.4602 4.72845 11.3981 5.17091C10.336 5.61338 9.37187 6.26155 8.56125 7.07812C6.91981 8.73201 5.9991 10.968 6 13.2981C6 17.2 8.1475 20.6125 10.215 23.0037C11.0965 24.0191 12.0522 24.9676 13.0744 25.8412C13.4644 26.1744 13.79 26.4338 14.02 26.61C14.1328 26.6969 14.2468 26.7823 14.3619 26.8662L14.3819 26.88L14.3875 26.8844L14.39 26.8856C14.6056 27.0375 14.8944 27.0375 15.11 26.8856ZM17.875 13.25C17.875 14.0788 17.5458 14.8737 16.9597 15.4597C16.3737 16.0458 15.5788 16.375 14.75 16.375C13.9212 16.375 13.1263 16.0458 12.5403 15.4597C11.9542 14.8737 11.625 14.0788 11.625 13.25C11.625 12.4212 11.9542 11.6263 12.5403 11.0403C13.1263 10.4542 13.9212 10.125 14.75 10.125C15.5788 10.125 16.3737 10.4542 16.9597 11.0403C17.5458 11.6263 17.875 12.4212 17.875 13.25Z" fill="#F43F5E"/>
				</svg>
			</div>
			<div class="content">
				<div>Место проведения</div>
				<address>ул. Зорге, д. 33</address>
			</div>
		</div>
	</div>
</section>

<style lang="scss">
	@use "$scss/mixins/scr";

	section {
		margin-top: 30px;
    margin-bottom: 30px;
	}

	.mobile_info {
    display: none;
		@include scr.tablet {
      display: flex;
		}

    flex-wrap: wrap;
    gap: 20px;
    margin-bottom: 20px;

    .rating {
      display: flex;
			align-items: center;
			gap: 5px;

			a {
        display: flex;
				gap: 5px;
				align-items: center;
			}

			> div:first-child {
        background: #01B306;
				padding: 4.5px 10px;
				border-radius: 10em;
				color: #fff;
				font-weight: 400;
				font-size: 16px;
			}
    }

		.to_favorite {
      display: flex;
			gap: 5px;

			:global button {
				width: 30px;
				height: 30px;
				background: #fff;
			}

      a {
        display: flex;
        gap: 5px;
        align-items: center;
      }
		}
	}

	.items {
    display: grid;
    grid-template-columns: repeat(4, auto);
		gap: 60px;

		@media (max-width: 1200px) {
      grid-template-columns: repeat(2, 1fr);
		}
    @include scr.tablet	{
      gap: 15px;
		}

		@include scr.mobile	{
      grid-template-columns: 1fr;
		}
	}

	.item {
    display: flex;
		align-items: center;
		gap: 15px;

    @include scr.mobile {
			font-size: 10px;
    }

		.icon {
      display: flex;
      flex-shrink: 0;

      background: linear-gradient(90deg, rgba(246, 109, 73, 0.3) 0%, rgba(244, 63, 94, 0.3) 100%);
			width: 50px;
			height: 50px;
      border-radius: 14px;

			> svg {
				margin: auto;
			}

      @include scr.mobile {
        width: 30px;
        height: 30px;

        > svg {
          width: 18px;
					height: 18px;
        }
      }
    }

		.content {
			color: var(--text-content-color);

			> * + * {
        display: block;
        margin-top: 6px;
				color: #000;
				font-size: 1.1em;
				font-weight: 600;
			}
		}
	}

	address {
		font-style: normal;
	}
</style>